Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-JH_DFP/1.0.88/PIC32CM-JH00/atdf/PIC32CM5164JH00048.atdf
        <module name="GCLK" id="U2122" version="1.1.2">
          <instance name="GCLK">
            <register-group name="GCLK" name-in-module="GCLK" address-space="base" offset="0x40001C00"/>
            <signals>
              <signal group="IO" index="0" function="H" pad="PB22"/>
              <signal group="IO" index="0" function="H" pad="PA14"/>
              <signal group="IO" index="0" function="H" pad="PA27"/>
              <signal group="IO" index="0" function="H" pad="PA30"/>
              <signal group="IO" index="0" function="H" pad="PA28"/>
              <signal group="IO" index="1" function="H" pad="PB23"/>
              <signal group="IO" index="1" function="H" pad="PA15"/>
              <signal group="IO" index="2" function="H" pad="PA16"/>
              <signal group="IO" index="3" function="H" pad="PA17"/>
              <signal group="IO" index="4" function="H" pad="PA10"/>
              <signal group="IO" index="4" function="H" pad="PA20"/>
              <signal group="IO" index="4" function="H" pad="PB10"/>
              <signal group="IO" index="5" function="H" pad="PA11"/>
              <signal group="IO" index="5" function="H" pad="PA21"/>
              <signal group="IO" index="5" function="H" pad="PB11"/>
              <signal group="IO" index="6" function="H" pad="PA22"/>
              <signal group="IO" index="7" function="H" pad="PA23"/>
            </signals>
            <parameters>
              <param name="GENDIV_BITS" value="16"/>
              <param name="GEN_BITS" value="4"/>
              <param name="GEN_NUM" value="9" caption="Number of Generic Clock Generators"/>
              <param name="GEN_NUM_MSB" value="8" caption="Number of Generic Clock Generators - 1"/>
              <param name="GEN_SOURCE_NUM_MSB" value="7" caption="Number of Generic Clock Sources - 1"/>
              <param name="NUM" value="43" caption="Number of Generic Clock Users"/>
              <param name="SOURCE_BITS" value="3"/>
              <param name="SOURCE_NUM" value="8" caption="Number of Generic Clock Sources"/>
              <param name="INSTANCE_ID" value="7" caption="Instance index for GCLK"/>
            </parameters>
          </instance>
        </module>
        <module name="ICM" id="U2010" version="1.2.0">
          <instance name="ICM">
            <register-group name="ICM" name-in-module="ICM" address-space="base" offset="0x42006400"/>
            <parameters>
              <param name="INSTANCE_ID" value="89" caption="Instance index for ICM"/>
            </parameters>
          </instance>
        </module>
        <module name="SMBIST" id="03788" version="1a0">
          <instance name="SMBIST">
            <register-group name="SMBIST" name-in-module="SMBIST" address-space="base" offset="0x42006c00"/>
            <parameters>
              <param name="EN_LMOB" value="0" caption="Enable Local SRAM MBIST On Boot."/>
              <param name="EN_ONLINE" value="1" caption="Enable online Local SRAM MBIST."/>
              <param name="INSTANCE_ID" value="91" caption="Instance index for SMBIST."/>
            </parameters>
          </instance>
        </module>
        <module name="MCLK" id="U2234" version="2.0.0">
          <instance name="MCLK">
            <register-group name="MCLK" name-in-module="MCLK" address-space="base" offset="0x40000800"/>
            <parameters>
              <param name="CTRLA_MCSEL_GCLK" value="1"/>
              <param name="CTRLA_MCSEL_OSC8M" value="0"/>
              <param name="MCLK_CLK_APB_NUM" value="4"/>
              <param name="SYSTEM_CLOCK" value="4000000" caption="System Clock Frequency at Reset"/>
              <param name="INSTANCE_ID" value="2" caption="Instance index for MCLK"/>
            </parameters>
            <clock-groups>
              <clock-group name="AHB" grouporder="0">
                <clock name="HPB0" bit="0"/>
                <clock name="HPB1" bit="1"/>
                <clock name="HPB2" bit="2"/>
                <clock name="DSU" bit="3"/>
                <clock name="HMATRIXHS" bit="4"/>
                <clock name="NVMCTRL" bit="5"/>
                <clock name="DRAM" bit="6"/>
                <clock name="DMAC" bit="7"/>
                <clock name="PAC" bit="10"/>
                <clock name="NVMCTRL_PICACHU" bit="11"/>
                <clock name="DIVAS" bit="12"/>
                <clock name="HPB3" bit="13"/>
                <clock name="ICM" bit="14"/>
              </clock-group>
            </clock-groups>
          </instance>
        </module>
        <module name="MCRAMC" id="03727" version="3a0">
          <instance name="MCRAMC">
            <register-group name="MCRAMC" name-in-module="MCRAMC" address-space="base" offset="0x40003000"/>
            <parameters>
              <param name="INSTANCE_ID" value="12" caption="Instance index for MCRAMC"/>
            </parameters>
          </instance>
        </module>
        <module name="MPU" version="1.0.0">
          <instance name="MPU">
            <register-group name="MPU" name-in-module="MPU" address-space="base" offset="0xE000ED90"/>
          </instance>
        </module>
        <module name="MTB" id="U2002" version="1.0.0">
          <instance name="MTB">
            <register-group name="MTB" name-in-module="MTB" address-space="base" offset="0x41008000"/>
            <parameters>
              <param name="INSTANCE_ID" value="36" caption="Instance index for MTB"/>
            </parameters>
          </instance>
        </module>
        <module name="NVIC" version="1.0.0">
          <instance name="NVIC">
            <register-group name="NVIC" name-in-module="NVIC" address-space="base" offset="0xE000E100"/>
            <parameters>
              <param name="NUM_IRQ" value="32" caption="Number of interrupt requests"/>
              <param name="__NVIC_PRIO_BITS" value="2" caption="Number of NVIC interrupt priority bits"/>
            </parameters>
          </instance>
        </module>
        <module name="NVMCTRL" id="03929" version="1a0">
          <instance name="NVMCTRL">
            <register-group name="NVMCTRL" name-in-module="NVMCTRL" address-space="base" offset="0x41004000"/>
            <signals>
              <signal group="MARGIN" function="default" pad="VMARGIN"/>
            </signals>
            <parameters>
              <param name="ECC_PRESENT" value="1" caption="define out all the added ECC logic - when =0 there shall be no ECC logic present in the design"/>
              <param name="FACTORY_WORD_IMPLEMENTED_MASK" value="0XC0000007FFFFFFFF"/>
              <param name="PMSB" value="3"/>
              <param name="PSZ_BITS" value="6"/>
              <param name="RSTFFLTADDR" value="0x00000000" caption="the reset default for FFLTADDR"/>
              <param name="USER_PAGE_OFFSET" value="0x00800000"/>
              <param name="USER_WORD_IMPLEMENTED_MASK" value="0XC01FFFFFFFFFFFFF"/>
              <param name="DATAFLASH_PAGES" value="128"/>
              <param name="DATAFLASH_ADDR" value="0x00400000" caption="Start address of the Data Flash area"/>
              <param name="DATAFLASH_SIZE" value="8192" caption="Byte size of the Data Flash area"/>
              <param name="FLASH_SIZE" value="524288"/>
              <param name="PAGE_SIZE" value="64"/>
              <param name="PAGES" value="8192"/>
              <param name="PAGES_PR_REGION" value="512"/>
              <param name="INSTANCE_ID" value="34" caption="Instance index for NVMCTRL"/>
            </parameters>
          </instance>
        </module>
        <module name="FUSES" id="03929" version="1a0">
          <instance name="FUSES">
            <register-group name="LOCKBIT_FUSES" name-in-module="LOCKBIT_FUSES" address-space="fuses" offset="0x00802000"/>
            <register-group name="OTP1_FUSES" name-in-module="OTP1_FUSES" address-space="fuses" offset="0x00806000"/>
            <register-group name="OTP2_FUSES" name-in-module="OTP2_FUSES" address-space="fuses" offset="0x00806008"/>
            <register-group name="OTP3_FUSES" name-in-module="OTP3_FUSES" address-space="fuses" offset="0x00806010"/>
